// ВНИМАНИЕ! Соблюдайте форматирование кода (отступы, переносы)

// 1. Создать 10 литералов представлюящих числа (5 целых и 5 дробных)




// 2. Создать 10 строковых литералов




// 3. Создать 10 объектов представляющих объекты реального мира. В каждом объекте должно быть не меньше 4 свойств.




// 4. Создать 10 массивов представляющих массивы некоторых значений из реальной жизни. В каждом массиве должно быть не меньше 4 элементов.




// 5. Объявить 5 переменных с произвольным именем.




// 6. Объявить еще 5 переменных и в момент объявления присвоить им значения произвольных типов данных.




// 7. Создать массив из элементов, значения которых представлены всеми изученными типами данных в JavaScript.




// 8. Создать объект из четырех свойств. Три свойства должны иметь значения простых типов данных. Два остальных свойства должны иметь значения составного (объектного) типа данных.




// 9. Написать выражения использующие все изученные арифметические операторы




// 10. Написать выражения использующие все изученные операторы сравнения




// 11. Написать выражения использующие все изученные логические операторы




// 12. Написать выражение использующее тернарный условный оператор




// 13. Написать выражения использующие все изученные операторы присваивания




// 14. Создать массив из 10 элементов (чисел) и написать выражения возвращающие значение первого, третьего, пятого и восьмого элемента




// 15. Создать массив и написать 3 выражения меняющие значения его элементов




// 16. Создать объект из 5 свойств и написать 3 выражения возвращающие значения произвольных свойств




// 17. Создать объект и написать 3 выражения меняющие значения его свойств
